cases/OpenFOAM/incompressible/pimpleFoam/RAS/TJunctionSwitching/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.2;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;       // 5% turbulent intensity
        value           $internalField;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    outlet2
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
